<script setup lang="ts">

</script>

<template>
    <section id="syconcart" class="container">
        <div class="syconcart">
            <div class="syconcart__title">
                <svg class="syconcart__title__svg" width="39" height="39" viewBox="0 0 39 39" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M19.4803 0L20.0275 13.4211L22.9622 0.313374L21.1041 13.6165L26.3322 1.24342L22.1286 14.0009L29.4819 2.76025L23.0679 14.5622L32.3102 4.81511L23.8919 15.2821L34.7261 7.34195L24.5742 16.1376L36.652 10.2596L25.0927 17.1012L38.0259 13.4742L25.4308 18.1418L38.8039 16.8825L25.5777 19.2262L38.9607 20.3749L25.5286 20.3193L38.4914 23.8392L25.2851 21.3861L37.4111 27.164L24.8551 22.3923L35.7545 30.2425L24.2523 23.3055L33.5748 32.9757L23.4961 24.0964L30.9422 35.2758L22.6108 24.7395L27.9411 37.0689L21.625 25.2143L24.6681 38.2973L20.5702 25.5054L21.2283 38.9215L19.4803 25.6035L17.7324 38.9215L18.3905 25.5054L14.2926 38.2973L17.3357 25.2143L11.0196 37.0689L16.3499 24.7395L8.01853 35.2758L15.4646 24.0964L5.38585 32.9757L14.7084 23.3055L3.20617 30.2425L14.1056 22.3923L1.54955 27.164L13.6756 21.3861L0.469252 23.8392L13.4321 20.3193L-1.71661e-05 20.3749L13.383 19.2262L0.156826 16.8825L13.5299 18.1418L0.934744 13.4742L13.868 17.1012L2.30873 10.2596L14.3865 16.1376L4.23463 7.34195L15.0688 15.2821L6.65054 4.81511L15.8928 14.5622L9.47881 2.76025L16.8321 14.0009L12.6285 1.24342L17.8566 13.6165L15.9985 0.313374L18.9332 13.4211L19.4803 0Z" fill="#A43033"/>
                </svg>
                <h2 class="syconcart__title__title-text fs-4">СуконкАрт</h2>
                <p class="syconcart__title__desc-text fs-1-5625">
                    <span class="bold">
                        <span class="red">Проект «СуконкАрт» — </span><br>
                        новое направление проекта «Нити х Нити». <br><br>
                    </span>

                    Это отдельное творческое пространство на Арамильской суконной фабрике, где объединяются архитектура, сценическое искусство
                    и современные технологии.
                </p>
            </div>
            <div class="syconcart__info-block">
                <div class="syconcart__info-block__text-block">
                    <h3 class="syconcart__info-block__title fs-1-5625">СуконкАрт — <br>
                        новые возможности для творчества любителей и профессионалов</h3>
                    <p class="syconcart__info-block__desc fs-0-875">В отдельной резиденции художники, архитекторы, режиссеры и другие творческие люди будут работать вместе на созданием интерактивных инсталляций, перфомансов и спектаклей, которые исследуют границы между физическим пространством и сценическим действием. </p>

                    <div class="syconcart__info-block__items">
                        <div class="item">
                            <svg class="item__svg" width="39" height="39" viewBox="0 0 39 39" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M19.4803 0L20.0275 13.4211L22.9622 0.313374L21.1041 13.6165L26.3322 1.24342L22.1286 14.0009L29.4819 2.76025L23.0679 14.5622L32.3102 4.81511L23.8919 15.2821L34.7261 7.34195L24.5742 16.1376L36.652 10.2596L25.0927 17.1012L38.0259 13.4742L25.4308 18.1418L38.8039 16.8825L25.5777 19.2262L38.9607 20.3749L25.5286 20.3193L38.4914 23.8392L25.2851 21.3861L37.4111 27.164L24.8551 22.3923L35.7545 30.2425L24.2523 23.3055L33.5748 32.9757L23.4961 24.0964L30.9422 35.2758L22.6108 24.7395L27.9411 37.0689L21.625 25.2143L24.6681 38.2973L20.5702 25.5054L21.2283 38.9215L19.4803 25.6035L17.7324 38.9215L18.3905 25.5054L14.2926 38.2973L17.3357 25.2143L11.0196 37.0689L16.3499 24.7395L8.01853 35.2758L15.4646 24.0964L5.38585 32.9757L14.7084 23.3055L3.20617 30.2425L14.1056 22.3923L1.54955 27.164L13.6756 21.3861L0.469252 23.8392L13.4321 20.3193L-1.71661e-05 20.3749L13.383 19.2262L0.156826 16.8825L13.5299 18.1418L0.934744 13.4742L13.868 17.1012L2.30873 10.2596L14.3865 16.1376L4.23463 7.34195L15.0688 15.2821L6.65054 4.81511L15.8928 14.5622L9.47881 2.76025L16.8321 14.0009L12.6285 1.24342L17.8566 13.6165L15.9985 0.313374L18.9332 13.4211L19.4803 0Z" fill="#A43033"/>
                            </svg>
                            <p class="item__text fs-1-5625">Художникам</p>
                        </div>
                        <div class="item">
                            <svg class="item__svg" width="39" height="39" viewBox="0 0 39 39" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M19.4803 0L20.0275 13.4211L22.9622 0.313374L21.1041 13.6165L26.3322 1.24342L22.1286 14.0009L29.4819 2.76025L23.0679 14.5622L32.3102 4.81511L23.8919 15.2821L34.7261 7.34195L24.5742 16.1376L36.652 10.2596L25.0927 17.1012L38.0259 13.4742L25.4308 18.1418L38.8039 16.8825L25.5777 19.2262L38.9607 20.3749L25.5286 20.3193L38.4914 23.8392L25.2851 21.3861L37.4111 27.164L24.8551 22.3923L35.7545 30.2425L24.2523 23.3055L33.5748 32.9757L23.4961 24.0964L30.9422 35.2758L22.6108 24.7395L27.9411 37.0689L21.625 25.2143L24.6681 38.2973L20.5702 25.5054L21.2283 38.9215L19.4803 25.6035L17.7324 38.9215L18.3905 25.5054L14.2926 38.2973L17.3357 25.2143L11.0196 37.0689L16.3499 24.7395L8.01853 35.2758L15.4646 24.0964L5.38585 32.9757L14.7084 23.3055L3.20617 30.2425L14.1056 22.3923L1.54955 27.164L13.6756 21.3861L0.469252 23.8392L13.4321 20.3193L-1.71661e-05 20.3749L13.383 19.2262L0.156826 16.8825L13.5299 18.1418L0.934744 13.4742L13.868 17.1012L2.30873 10.2596L14.3865 16.1376L4.23463 7.34195L15.0688 15.2821L6.65054 4.81511L15.8928 14.5622L9.47881 2.76025L16.8321 14.0009L12.6285 1.24342L17.8566 13.6165L15.9985 0.313374L18.9332 13.4211L19.4803 0Z" fill="#A43033"/>
                            </svg>
                            <p class="item__text fs-1-5625">Режиссерам</p>
                        </div>
                        <div class="item">
                            <svg class="item__svg" width="39" height="39" viewBox="0 0 39 39" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M19.4803 0L20.0275 13.4211L22.9622 0.313374L21.1041 13.6165L26.3322 1.24342L22.1286 14.0009L29.4819 2.76025L23.0679 14.5622L32.3102 4.81511L23.8919 15.2821L34.7261 7.34195L24.5742 16.1376L36.652 10.2596L25.0927 17.1012L38.0259 13.4742L25.4308 18.1418L38.8039 16.8825L25.5777 19.2262L38.9607 20.3749L25.5286 20.3193L38.4914 23.8392L25.2851 21.3861L37.4111 27.164L24.8551 22.3923L35.7545 30.2425L24.2523 23.3055L33.5748 32.9757L23.4961 24.0964L30.9422 35.2758L22.6108 24.7395L27.9411 37.0689L21.625 25.2143L24.6681 38.2973L20.5702 25.5054L21.2283 38.9215L19.4803 25.6035L17.7324 38.9215L18.3905 25.5054L14.2926 38.2973L17.3357 25.2143L11.0196 37.0689L16.3499 24.7395L8.01853 35.2758L15.4646 24.0964L5.38585 32.9757L14.7084 23.3055L3.20617 30.2425L14.1056 22.3923L1.54955 27.164L13.6756 21.3861L0.469252 23.8392L13.4321 20.3193L-1.71661e-05 20.3749L13.383 19.2262L0.156826 16.8825L13.5299 18.1418L0.934744 13.4742L13.868 17.1012L2.30873 10.2596L14.3865 16.1376L4.23463 7.34195L15.0688 15.2821L6.65054 4.81511L15.8928 14.5622L9.47881 2.76025L16.8321 14.0009L12.6285 1.24342L17.8566 13.6165L15.9985 0.313374L18.9332 13.4211L19.4803 0Z" fill="#A43033"/>
                            </svg>
                            <p class="item__text fs-1-5625">Архитекторам</p>
                        </div>
                        <div class="item">
                            <svg class="item__svg" width="39" height="39" viewBox="0 0 39 39" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M19.4803 0L20.0275 13.4211L22.9622 0.313374L21.1041 13.6165L26.3322 1.24342L22.1286 14.0009L29.4819 2.76025L23.0679 14.5622L32.3102 4.81511L23.8919 15.2821L34.7261 7.34195L24.5742 16.1376L36.652 10.2596L25.0927 17.1012L38.0259 13.4742L25.4308 18.1418L38.8039 16.8825L25.5777 19.2262L38.9607 20.3749L25.5286 20.3193L38.4914 23.8392L25.2851 21.3861L37.4111 27.164L24.8551 22.3923L35.7545 30.2425L24.2523 23.3055L33.5748 32.9757L23.4961 24.0964L30.9422 35.2758L22.6108 24.7395L27.9411 37.0689L21.625 25.2143L24.6681 38.2973L20.5702 25.5054L21.2283 38.9215L19.4803 25.6035L17.7324 38.9215L18.3905 25.5054L14.2926 38.2973L17.3357 25.2143L11.0196 37.0689L16.3499 24.7395L8.01853 35.2758L15.4646 24.0964L5.38585 32.9757L14.7084 23.3055L3.20617 30.2425L14.1056 22.3923L1.54955 27.164L13.6756 21.3861L0.469252 23.8392L13.4321 20.3193L-1.71661e-05 20.3749L13.383 19.2262L0.156826 16.8825L13.5299 18.1418L0.934744 13.4742L13.868 17.1012L2.30873 10.2596L14.3865 16.1376L4.23463 7.34195L15.0688 15.2821L6.65054 4.81511L15.8928 14.5622L9.47881 2.76025L16.8321 14.0009L12.6285 1.24342L17.8566 13.6165L15.9985 0.313374L18.9332 13.4211L19.4803 0Z" fill="#A43033"/>
                            </svg>
                            <p class="item__text fs-1-5625">Актерам</p>
                        </div>
                        <div class="item">
                            <svg class="item__svg" width="39" height="39" viewBox="0 0 39 39" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path d="M19.4803 0L20.0275 13.4211L22.9622 0.313374L21.1041 13.6165L26.3322 1.24342L22.1286 14.0009L29.4819 2.76025L23.0679 14.5622L32.3102 4.81511L23.8919 15.2821L34.7261 7.34195L24.5742 16.1376L36.652 10.2596L25.0927 17.1012L38.0259 13.4742L25.4308 18.1418L38.8039 16.8825L25.5777 19.2262L38.9607 20.3749L25.5286 20.3193L38.4914 23.8392L25.2851 21.3861L37.4111 27.164L24.8551 22.3923L35.7545 30.2425L24.2523 23.3055L33.5748 32.9757L23.4961 24.0964L30.9422 35.2758L22.6108 24.7395L27.9411 37.0689L21.625 25.2143L24.6681 38.2973L20.5702 25.5054L21.2283 38.9215L19.4803 25.6035L17.7324 38.9215L18.3905 25.5054L14.2926 38.2973L17.3357 25.2143L11.0196 37.0689L16.3499 24.7395L8.01853 35.2758L15.4646 24.0964L5.38585 32.9757L14.7084 23.3055L3.20617 30.2425L14.1056 22.3923L1.54955 27.164L13.6756 21.3861L0.469252 23.8392L13.4321 20.3193L-1.71661e-05 20.3749L13.383 19.2262L0.156826 16.8825L13.5299 18.1418L0.934744 13.4742L13.868 17.1012L2.30873 10.2596L14.3865 16.1376L4.23463 7.34195L15.0688 15.2821L6.65054 4.81511L15.8928 14.5622L9.47881 2.76025L16.8321 14.0009L12.6285 1.24342L17.8566 13.6165L15.9985 0.313374L18.9332 13.4211L19.4803 0Z" fill="#A43033"/>
                            </svg>
                            <p class="item__text fs-1-5625">И другим креативным деятелям</p>
                        </div>
                    </div>
                </div>
                <div class="syconcart__info-block__content">
                    <img class="syconcart__info-block__content__img" src="../../assets/img/suconcart.png" alt="">
                    <p class="syconcart__info-block__content__desc fs-0-875">Команда и участники проекта «Нити х Нити» в 2024 году</p>
                </div>
            </div>
        </div>
    </section>
</template>

<style lang="scss" scoped>
    .syconcart {
        margin-top: 10.625rem;

        display: flex;
        flex-direction: column;
        gap: 3.125rem;
        
        @include mobile {
            margin-top: 6.25rem;
        }
        &__title {
            display: flex;
            flex-direction: column;
            align-items: center;
            gap: 1.25rem;
            
            &__svg {
                width: 2.4375rem;
                height: 2.4375rem;
            }

            &__title-text {
                @include gardenia;
                color: #171717;
                // font-weight: 100;
                // text-transform: uppercase;
                @include mobile {
                    font-weight: 500;
                }
            }
            &__desc-text {
                width: 48.75rem;
                
                letter-spacing: -0.0625rem;
                color: #2E2D2D;
                text-align: center;

                @include mobile {
                    width: 100%;
                }
            }
            .bold {
                @include mobile {
                    font-weight: bold;
                }
            }
            .red {
                color: #A43033;
            }
        }
        &__info-block {
            width: 100%;
            padding: 3.125rem 3.4375rem 3.3125rem 3.125rem;

            display: flex;
            justify-content: space-between;

            background-color: #EDEDE6;
            border-radius: 0.625rem;

            @include mobile {
                padding: 2rem 1.5rem;

                flex-direction: column;
            }
            
            &__content {
                display: flex;
                flex-direction: column;
                align-items: center;
                gap: 2.1875rem;
                &__img {
                    height: 24.1875rem;
                    @include mobile {
                        width: 100%;
                        height: fit-content;
                    }
                }
                &__desc {
                    color: #2E2D2D;
                    line-height: 130%;
                    letter-spacing: 0.0063rem;

                    @include mobile {
                        text-align: center;
                    }
                }
            }

            &__text-block {
                max-width: 30rem;

                display: flex;
                flex-direction: column;
            }

            &__title {
                letter-spacing: -0.0825rem;
                color: #A43033;
                font-weight: 500;
                margin-bottom: 1.5625rem;

                @include mobile {
                    width: 100%;
                    letter-spacing: -0.05rem;
                    text-align: center;
                    order: 1;
                }
            }

            &__desc {
                color: #2E2D2D;
                line-height: 130%;
                letter-spacing: 0.0063rem;
                margin-bottom: 2.9375rem;

                @include mobile {
                    order: 3;
                    margin-bottom: 1.875rem;
                
                    text-align: center;
                }
            }

            &__items {
                display: flex;
                flex-wrap: wrap;
                gap: 0.3125rem;

                @include mobile {
                    order: 2;
                    margin-bottom: 2.9375rem;
                }
                
                .item {
                    padding: 0.75rem 1.6875rem 0.75rem 0.875rem;

                    background-color: #E5E0D9;
                    border-radius: 0.3125rem;

                    display: flex;
                    align-items: center;
                    gap: 0.875rem;

                    @include mobile {
                        gap: 0.5rem;
                        padding: 0.625rem 0.5625rem;
                    }

                    &__svg {
                        width: 2.4375rem;
                        height: 2.4375rem;
                        
                        @include mobile {
                            width: 1.875rem;
                            height: 1.875rem;
                        }
                    }
                    &__text {
                        letter-spacing: -.0825rem;
                        color: #2E2D2D;

                        @include mobile {
                            letter-spacing: -0.0375rem;
                        }
                    }
                }
            }

        }
    }
</style>